---
kind: method
id: M:Autodesk.Revit.DB.OpenOptions.GetOpenWorksetsConfiguration
source: html/f06b3060-cd2d-31db-f627-fe0d96236e3c.htm
---
# Autodesk.Revit.DB.OpenOptions.GetOpenWorksetsConfiguration Method

Gets the object used to configure the worksets to open when the model is opened.

## Syntax (C#)
```csharp
public WorksetConfiguration GetOpenWorksetsConfiguration()
```

## Returns
The options. If Nothing nullptr a null reference ( Nothing in Visual Basic) , all user-created worksets will be opened.